# CLI ツール
brew "git"                     # バージョン管理システム、GitHub との連携に必須
brew "stow"                    # シンボリックリンクで dotfiles を管理、stow zsh で ~/.zshrc にリンク作成
brew "fzf"                     # あいまい検索ツール、Ctrl+R で履歴検索、Ctrl+T でファイル検索が可能に
brew "zoxide"                  # cd の代替、過去に行ったディレクトリを学習して z foo で即ジャンプ
brew "mise"                    # Node.js/Python 等のバージョン管理、nodenv/pyenv の統合版で Rust 製で高速
brew "eza"                     # ls の代替、アイコン表示・Git status 表示・ツリー表示に対応
brew "bat"                     # cat の代替、シンタックスハイライト・行番号・Git 差分表示に対応
brew "ripgrep"                 # grep の代替、.gitignore を自動で尊重し超高速に検索、rg で実行
brew "fd"                      # find の代替、シンプルな構文で高速検索、fd .ts で TypeScript ファイル一覧
brew "gh"                      # GitHub 公式 CLI、gh pr create で PR 作成、gh repo clone でクローン
brew "lazygit"                 # ターミナル上の Git GUI、ステージング・コミット・プッシュをキーボードで操作
brew "starship"                # カスタマイズ可能なプロンプト、Git ブランチ・Node バージョン等を表示
brew "zsh-completions"         # zsh の追加補完定義、brew/docker/npm 等のコマンド補完が強化される
brew "jq"                      # JSON をコマンドラインで整形・フィルタ、curl の結果を | jq . でパース
brew "httpie"                  # curl の代替、http GET api.com のような直感的な構文で API 呼び出し
brew "delta"                   # git diff を見やすく表示、シンタックスハイライト・行番号・横並び表示
brew "watchman"                # ファイル変更を監視、React Native のホットリロードに必要
brew "cocoapods"               # iOS の依存関係管理、pod install で Xcode プロジェクトにライブラリ追加
brew "terminal-notifier"       # macOS 通知をコマンドから送信、長時間タスク完了時の通知に使用
brew "go"                      # Go 言語、高速なコンパイル・シンプルな構文・並行処理が得意
brew "fastlane"                # iOS/Androidアプリのビルド・署名・配布を自動化するツール
brew "ni"                      # Node.js のインストール管理、npm install の代替

# GUI アプリ
cask "google-chrome"           # ブラウザ、DevTools でのデバッグ・React DevTools 拡張に使用
cask "cursor"                  # VS Code ベースの AI エディタ、Cmd+I で AI とペアプログラミング
cask "visual-studio-code"      # 定番エディタ、Cursor が不安定な時のバックアップ用
cask "docker"                  # コンテナ実行環境、開発環境の統一・DB のローカル起動に使用
cask "tableplus"               # データベース GUI、PostgreSQL/MySQL/SQLite を視覚的に操作
cask "ghostty"                 # Rust 製の高速ターミナル、GPU アクセラレーション・分割・タブ対応
cask "raycast"                 # Spotlight 代替のランチャー、クリップボード履歴・スニペット・ウィンドウ管理
cask "karabiner-elements"      # キーボードカスタマイズ、英数/かな→Cmd、Cmd 単体で英数/かな切替
cask "obsidian"                # テキスト編集
cask "android-studio"          # androidエミュレータ

# フォント（Nerd Fonts = アイコン内蔵フォント、eza/starship でアイコン表示に必要）
cask "font-hack-nerd-font"     # プログラミング用等幅フォント Hack に Nerd Fonts アイコンを追加
cask "font-hackgen-nerd"       # 日本語対応の Hack、半角:全角=1:2 で綺麗に揃う
cask "chatgpt-atlas"           # ChatGPT の Atlas 拡張
